app/controllers/posts_controller.rb

	def index
		@posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts"   ORDER BY created_at DESC

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "asd"], ["created_at", "2015-07-14 08:06:25.492510"], ["title", "hello"], ["updated_at", "2015-07-14 08:06:25.492510"]]

	def update
	    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]